use crate::icon_bytes;
use embedded_graphics::image::ImageRaw;
use embedded_graphics::pixelcolor::BinaryColor;

pub const ICON_EMPTY: ImageRaw<BinaryColor> = ImageRaw::<BinaryColor>::new(&[0u8; 0], 0);

const CROSS_BYTES: [u8; 5] = icon_bytes!("
█░░░█
░█░█░
░░█░░
░█░█░
█░░░█
");
pub const ICON_CROSS: ImageRaw<BinaryColor> = ImageRaw::<BinaryColor>::new(&CROSS_BYTES, 5);

const OHM_BYTES: [u8; 20] = icon_bytes!("
░░░███░░░
░░█░░░█░░
░█░░░░░█░
█░░░░░░░█
█░░░░░░░█
█░░░░░░░█
░█░░░░░█░
░░█░░░█░░
░░█░░░█░░
███░░░███
");
pub const ICON_OHM: ImageRaw<BinaryColor> = ImageRaw::<BinaryColor>::new(&OHM_BYTES, 9);

const CHARGING_BYTES: [u8; 12] = icon_bytes!("
░░░█░░
░░░█░░
░░██░░
░░██░░
░███░█
░█████
█████░
█░███░
░░██░░
░░██░░
░░█░░░
░░█░░░
");
pub const ICON_CHARGING: ImageRaw<BinaryColor> = ImageRaw::<BinaryColor>::new(&CHARGING_BYTES, 6);

pub const ICON_CHARGED: ImageRaw<BinaryColor> = ImageRaw::<BinaryColor>::new(&inverse(&CHARGING_BYTES), 6);

const PUFF_BYTES: [u8; 20] = icon_bytes!("
░░█░░█░░░
░█░░█░░░░
█░░░░████
░█░░░░░░░
░░███████
░░███████
░█░░░░░░░
█░░░░████
░█░░█░░░░
░░█░░█░░░
");
pub const

ICON_PUFF: ImageRaw<BinaryColor> = ImageRaw::<BinaryColor>::new(&PUFF_BYTES, 9);

const REVERSE_BYTES: [u8; 18] = icon_bytes!("
░░░█████░
░░░██████
░░░░░░███
░░█░░░░██
░██░░░███
█████████
████████░
░██░░░░░░
░░█░░░░░░
");
pub const ICON_REVERSE: ImageRaw<BinaryColor> = ImageRaw::<BinaryColor>::new(&REVERSE_BYTES, 9);

const WARNING_BYTES: [u8; 9] = icon_bytes!("
██
██
██
██
██
██
░░
██
██
");
pub const ICON_WARNING: ImageRaw<BinaryColor> = ImageRaw::<BinaryColor>::new(&WARNING_BYTES, 2);

const ONE_BYTES: [u8; 9] = icon_bytes!("
░██░
░██░
░██░
░██░
░██░
░██░
░██░
░██░
░██░
");
pub const ICON_ONE: ImageRaw<BinaryColor> = ImageRaw::<BinaryColor>::new(&ONE_BYTES, 4);

pub const BRIGHTNESS_ICON_SIZE: u32 = 12;

const SUN_STROKE_BYTES: [u8; 24] = icon_bytes!("
░░░█░░░░█░░░
░░░██░░██░░░
░░░░░░░░░░░░
██░░░██░░░██
░█░░█░░█░░█░
░░░█░░░░█░░░
░░░█░░░░█░░░
░█░░█░░█░░█░
██░░░██░░░██
░░░░░░░░░░░░
░░░██░░██░░░
░░░█░░░░█░░░
");
pub const SUN_STROKE: ImageRaw<BinaryColor> = ImageRaw::<BinaryColor>::new(&SUN_STROKE_BYTES, BRIGHTNESS_ICON_SIZE);

const SUN_FILL_BYTES: [u8; 24] = icon_bytes!("
░░░█░░░░█░░░
░░░██░░██░░░
░░░░░░░░░░░░
██░░░██░░░██
░█░░████░░█░
░░░██████░░░
░░░██████░░░
░█░░████░░█░
██░░░██░░░██
░░░░░░░░░░░░
░░░██░░██░░░
░░░█░░░░█░░░
");
pub const SUN_FILL: ImageRaw<BinaryColor> = ImageRaw::<BinaryColor>::new(&SUN_FILL_BYTES, BRIGHTNESS_ICON_SIZE);

const MOON_STROKE_BYTES: [u8; 24] = icon_bytes!("
░░░░░░░░░░░░
░░░░████░░░░
░░░█░░█░░░░░
░░█░░█░░░░░░
░█░░█░░░░░░░
░█░░█░░░░░░░
░█░░░█░░░░█░
░█░░░░█░░██░
░░█░░░░███░░
░░░█░░░░█░░░
░░░░████░░░░
░░░░░░░░░░░░
");
pub const MOON_STROKE: ImageRaw<BinaryColor> = ImageRaw::<BinaryColor>::new(&MOON_STROKE_BYTES, BRIGHTNESS_ICON_SIZE);

const MOON_FILL_BYTES: [u8; 24] = icon_bytes!("
░░░░░░░░░░░░
░░░░████░░░░
░░░████░░░░░
░░████░░░░░░
░████░░░░░░░
░████░░░░░░░
░█████░░░░█░
░██████░░██░
░░████████░░
░░░██████░░░
░░░░████░░░░
░░░░░░░░░░░░
");
pub const MOON_FILL: ImageRaw<BinaryColor> = ImageRaw::<BinaryColor>::new(&MOON_FILL_BYTES, BRIGHTNESS_ICON_SIZE);

const fn inverse<const N: usize>(arr: &[u8; N]) -> [u8; N] {
    let mut result = [0u8; N];
    let mut i = 0;
    while i < N {
        result[i] = !arr[i];
        i += 1;
    }
    return result
}
